custom_models/Cylinder_con/Oldroyd-BLog/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          120;
        startFace       101580;
    }
    walls
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          480;
        startFace       101700;
    }
    cylinder
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          540;
        startFace       102180;
    }
    outlet
    {
        type            patch;
        nFaces          180;
        startFace       102720;
    }
    frontAndBack
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          102240;
        startFace       102900;
    }
)

// ************************************************************************* //
